# Pandas
Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

In [289]:
import pandas as pd
import numpy as np
import os

## Data Types
### Numpy Array
A Numpy array is a 1 row array.

In [290]:
np.random.rand(3)
np.array([1,2,3])

array([1, 2, 3])

### Series
Series is a one-dimensional labeled array (column) capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to call:

In [291]:
pd.Series({'a1': 2, 'a2': 'b'}) # Using Dictionary
pd.Series([1, 'b'], index=['a1', 'a2']) # Using List of values and list index
pd.Series(5.1, index=['a', 'b', 'c']) # Using scalar

a    5.1
b    5.1
c    5.1
dtype: float64

#### Slicing 
A series can be sliced

In [292]:
pd.Series([1,2,3], index=['a', 'b', 'c'])[0:2]

a    1
b    2
dtype: int64

As the series is indexed, it also behaves like a dictionary

In [293]:
pd.Series([1,2,3], index=['a', 'b', 'c'])['b']
pd.Series([1,2,3], index=['a', 'b', 'c']).get('d', np.NaN)
pd.Series([1,2,3], index=['a', 'b', 'c']).get('b')

2

#### Basic Operations
Basic operations can be done in series without the need of iterating through each element. This operations allow both for using scalars as well as another series.
* Additions of a series with an scalar or another series
* Multiplication of a series with an scalar or another series

In [294]:
# Additions
pd.Series([1,2,3], index=['a', 'b', 'c']) + pd.Series([1,2,3,5], index=['a', 'b', 'c', 'd'])

a    2.0
b    4.0
c    6.0
d    NaN
dtype: float64

In [295]:
# Multiplication 
pd.Series([1,2,3], index=['a', 'b', 'c']) * pd.Series([1,2,3], index=['a', 'b', 'c'])

a    1
b    4
c    9
dtype: int64

___
## Data Types
### Pandas DataFrame
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:

Dict of 1D ndarrays, lists, dicts, or Series
- 2-D numpy.ndarray
- Structured or record ndarray
- A Series
- Another DataFrame
Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments. If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame. Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.

In [296]:
# Union of 2 dict of Series 
d = {
    'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
}
pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [297]:
# Union of 2 Dict of dicts
d = {
    'one': {'a':1, 'b':2}, 
    'two': {'a':1, 'c':'d'}
}
pd.DataFrame(d)

   one  two
a  1.0    1
b  2.0  NaN
c  NaN    d

#### Getting data
Data can be obtained by using built-in functions such as:
* `pd.read_csv()`
* `pd_read_excel()`
* `pd_read_sql`

more info on <https://pandas.pydata.org/pandas-docs/stable/reference/io.html>

In [298]:
players_df = pd.read_csv('./data/Master.csv')
# columns_to_use = ['id', 'title', 'artist', 'medium']
'''
df_sample_c =pd.read_csv(os.path.join('.', 'collection-master', 'artwork_data.csv'), 
    nrows=5, index_col='id', usecols=columns_to_use)
'''
players_df.head(2)

,playerID,coachID,hofID,firstName,lastName,nameNote,nameGiven,nameNick,height,weight,...,birthDay,birthCountry,birthState,birthCity,deathYear,deathMon,deathDay,deathCountry,deathState,deathCity
0,aaltoan01,NaN,NaN,Antti,Aalto,NaN,Antti,NaN,73.0,210.0,...,4.0,Finland,NaN,Lappeenranta,NaN,NaN,NaN,NaN,NaN,NaN
1,abbeybr01,NaN,NaN,Bruce,Abbey,NaN,Bruce,NaN,73.0,185.0,...,18.0,Canada,ON,Toronto,NaN,NaN,NaN,NaN,NaN,NaN

#### Getting basic information on dataframe
* **Shape** gives the number of rows x columns in a tuple
* **Info** gives detailed info on each label
* **Describe** gives basic statistics on numeric columns

In [299]:
players_df.shape

(7761, 31)

In [300]:
players_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7761 entries, 0 to 7760
Data columns (total 31 columns):
playerID        7520 non-null object
coachID         395 non-null object
hofID           366 non-null object
firstName       7748 non-null object
lastName        7761 non-null object
nameNote        18 non-null object
nameGiven       5985 non-null object
nameNick        1306 non-null object
height          7334 non-null float64
weight          7336 non-null float64
shootCatch      7048 non-null object
legendsID       6577 non-null object
ihdbID          7125 non-null float64
hrefID          7457 non-null object
firstNHL        6851 non-null float64
lastNHL         6851 non-null float64
firstWHA        903 non-null float64
lastWHA         903 non-null float64
pos             7447 non-null object
birthYear       7543 non-null float64
birthMon        7506 non-null float64
birthDay        7504 non-null float64
birthCountry    7396 non-null object
birthState      6324 non-null object
birthCity       7388 non-null object
deathYear       1320 non-null float64
deathMon        1173 non-null float64
deathDay        1168 non-null float64
deathCountry    498 non-null object
deathState      471 non-null object
deathCity       483 non-null object
dtypes: float64(13), object(18)
memory usage: 1.8+ MB

In [301]:
players_df.describe()

,height,weight,ihdbID,firstNHL,lastNHL,firstWHA,lastWHA,birthYear,birthMon,birthDay,deathYear,deathMon,deathDay
count,7334.000000,7336.000000,7125.000000,6851.000000,6851.000000,903.000000,903.000000,7543.000000,7506.000000,7504.000000,1320.000000,1173.000000,1168.000000
mean,71.904418,189.503953,18159.395930,1979.898555,1985.173551,1974.256921,1975.746401,1955.170091,6.056088,15.605144,2547.587121,6.670929,15.244863
std,2.328650,18.341611,22852.778006,24.150092,24.359206,2.123774,1.947460,26.379075,3.434267,8.917103,2052.311223,3.484605,8.601029
min,63.000000,125.000000,45.000000,1917.000000,1917.000000,1972.000000,1972.000000,1841.000000,1.000000,1.000000,1907.000000,1.000000,1.000000
25%,70.000000,178.000000,3339.000000,1968.000000,1974.000000,1972.000000,1974.000000,1943.000000,3.000000,8.000000,1970.000000,4.000000,8.000000
50%,72.000000,190.000000,7500.000000,1985.000000,1991.000000,1974.000000,1976.000000,1961.000000,6.000000,15.000000,1989.000000,7.000000,15.000000
75%,73.000000,200.000000,23463.000000,1999.000000,2006.000000,1976.000000,1978.000000,1975.000000,9.000000,23.000000,2002.000000,10.000000,23.000000
max,81.000000,265.000000,118280.000000,2011.000000,2011.000000,1978.000000,1978.000000,1993.000000,12.000000,31.000000,9999.000000,12.000000,31.000000

### Get basic info on a label

Obtain unique values per label
* Get unique values
* Count unique values
* Get statistics on a numeric column
* Get statistics values of other cols grouped by that column

In [302]:
len(players_df['pos'].unique())

19

Count of unique per column

In [303]:
players_df.groupby('pos').size()

pos
C      1605
C/D       3
C/L       2
C/R       2
D      2218
D/C       1
D/L       2
D/R       1
F        43
G       761
L      1450
L/C       2
L/D       1
R      1348
R/C       5
R/D       1
R/L       1
W         1
dtype: int64

In [304]:
players_df['height'].describe()

count    7334.000000
mean       71.904418
std         2.328650
min        63.000000
25%        70.000000
50%        72.000000
75%        73.000000
max        81.000000
Name: height, dtype: float64

In [305]:
players_df.groupby('pos').describe()

     height                                                       weight  \
      count       mean       std   min    25%   50%    75%   max   count
pos
C    1585.0  71.446057  2.262401  65.0  70.00  71.0  73.00  78.0  1585.0
C/D     3.0  69.000000  2.000000  67.0  68.00  69.0  70.00  71.0     3.0
C/L     2.0  70.500000  0.707107  70.0  70.25  70.5  70.75  71.0     2.0
C/R     2.0  70.000000  0.000000  70.0  70.00  70.0  70.00  70.0     2.0
D    2183.0  72.727897  2.146595  65.0  71.00  73.0  74.00  81.0  2183.0
D/C     1.0  66.000000       NaN  66.0  66.00  66.0  66.00  66.0     1.0
D/L     2.0  71.500000  0.707107  71.0  71.25  71.5  71.75  72.0     2.0
D/R     1.0  74.000000       NaN  74.0  74.00  74.0  74.00  74.0     1.0
F      41.0  72.024390  1.981007  67.0  71.00  72.0  73.00  76.0    41.0
G     730.0  71.295890  2.492812  63.0  70.00  71.0  73.00  79.0   730.0
L    1430.0  71.820280  2.260937  65.0  70.00  72.0  73.00  80.0  1431.0
L/C     2.0  68.500000  3.535534  66.0  67.25  68.5  69.75  71.0     2.0
L/D     1.0  70.000000       NaN  70.0  70.00  70.0  70.00  70.0     1.0
R    1336.0  71.582335  2.280506  65.0  70.00  72.0  73.00  79.0  1337.0
R/C     4.0  69.250000  1.892969  68.0  68.00  68.5  69.75  72.0     4.0
R/D     1.0  68.000000       NaN  68.0  68.00  68.0  68.00  68.0     1.0
R/L     0.0        NaN       NaN   NaN    NaN   NaN    NaN   NaN     0.0
W       0.0        NaN       NaN   NaN    NaN   NaN    NaN   NaN     0.0

                 ... deathMon       deathDay                             \
           mean  ...      75%   max    count       mean       std   min
pos              ...
C    184.956467  ...     10.0  12.0    222.0  15.936937  8.634645   1.0
C/D  170.000000  ...      NaN   NaN      0.0        NaN       NaN   NaN
C/L  175.000000  ...      NaN   NaN      0.0        NaN       NaN   NaN
C/R  182.500000  ...     10.0  10.0      1.0  22.000000       NaN  22.0
D    196.961521  ...     10.0  12.0    319.0  15.557994  8.682860   1.0
D/C  150.000000  ...      9.0   9.0      1.0  16.000000       NaN  16.0
D/L  192.500000  ...      7.0   7.0      1.0  23.000000       NaN  23.0
D/R  195.000000  ...      NaN   NaN      0.0        NaN       NaN   NaN
F    186.951220  ...     11.0  12.0      6.0  21.000000  9.859006   2.0
G    180.931507  ...     10.0  12.0     94.0  15.042553  9.213028   1.0
L    189.272537  ...     10.0  12.0    227.0  14.242291  8.662214   1.0
L/C  182.500000  ...      NaN   NaN      0.0        NaN       NaN   NaN
L/D  180.000000  ...      9.0   9.0      1.0  15.000000       NaN  15.0
R    188.183994  ...      9.0  12.0    202.0  14.712871  8.439232   1.0
R/C  164.500000  ...     11.0  11.0      1.0   5.000000       NaN   5.0
R/D  154.000000  ...      NaN   NaN      0.0        NaN       NaN   NaN
R/L         NaN  ...      NaN   NaN      0.0        NaN       NaN   NaN
W           NaN  ...      6.0   6.0      1.0   4.000000       NaN   4.0


       25%   50%    75%   max
pos
C     9.00  15.0  23.00  31.0
C/D    NaN   NaN    NaN   NaN
C/L    NaN   NaN    NaN   NaN
C/R  22.00  22.0  22.00  22.0
D     8.00  15.0  23.50  31.0
D/C  16.00  16.0  16.00  16.0
D/L  23.00  23.0  23.00  23.0
D/R    NaN   NaN    NaN   NaN
F    20.50  25.0  25.75  29.0
G     7.25  13.0  23.75  31.0
L     7.00  14.0  21.50  31.0
L/C    NaN   NaN    NaN   NaN
L/D  15.00  15.0  15.00  15.0
R     8.00  15.0  21.00  31.0
R/C   5.00   5.0   5.00   5.0
R/D    NaN   NaN    NaN   NaN
R/L    NaN   NaN    NaN   NaN
W     4.00   4.0   4.00   4.0

[18 rows x 104 columns]

## Filtering
### Drop Records
more details later on loc

In [319]:
players_df_trim_df = players_df.loc[players_df['lastNHL']>=1980]
players_df_trim_df.shape

(4627, 31)

#### DropNA

In [328]:
# records
orig_players_df = players_df_trim_df.copy()
players_df_trim_df = players_df_trim_df.dropna(subset=['playerID'])
players_df_trim_df.shape

(4627, 10)

In [31]:
# how determines only removing those where both are NA
players_df = players_df.dropna(subset=['firstNHL', 'lastNHL'], how='all')
players_df.shape

(6851, 31)

### Drop columns
use `df.filter` with the columns to keep or `drop` witha xis=1

In [ ]:
players_df.drop(labels='birthDay', axis=1, inplace=True, errors='raise')

In [320]:
players_df_trim_df = players_df_trim_df.filter(regex='(playerID|pos|^birth)|(Name$)')
players_df_trim_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4627 entries, 0 to 7760
Data columns (total 10 columns):
playerID        4627 non-null object
firstName       4627 non-null object
lastName        4627 non-null object
pos             4627 non-null object
birthYear       4627 non-null float64
birthMon        4627 non-null float64
birthDay        4627 non-null float64
birthCountry    4490 non-null object
birthState      3523 non-null object
birthCity       4490 non-null object
dtypes: float64(3), object(7)
memory usage: 397.6+ KB

#### Iloc

Integer location `iloc` allows to query by row number

In [321]:
players_df_trim_df.iloc[0:3]

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
0,aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
4,abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon
9,abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal

or using a boolean array (`df.values` returns array)

In [322]:
players_df_trim_df.iloc[(players_df_trim_df['birthYear']>1990).values].head()

,playerID,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
174,ashtoca01,Carter,Ashton,R,1991.0,4.0,1.0,NaN,NaN,NaN
234,baertsv01,Sven,Baertschi,L,1992.0,10.0,5.0,NaN,NaN,NaN
305,barrity01,Tyson,Barrie,D,1991.0,7.0,26.0,NaN,NaN,NaN
885,bulmebr01,Brett,Bulmer,R,1992.0,4.0,26.0,NaN,NaN,NaN
900,burmial01,Alexander,Burmistrov,C,1991.0,10.0,21.0,Russia,NaN,Kazan

#### LOC
location is used to:
* filter by the index
* or using a boolean array... the later can be used to get reduce the df

In [323]:
players_df_trim_df.loc[1106]

playerID        charazd01
firstName           Zdeno
lastName            Chara
pos                     D
birthYear            1977
birthMon                3
birthDay               18
birthCountry     Slovakia
birthState            NaN
birthCity         Trencin
Name: 1106, dtype: object

In [326]:
players_df_trim_df.loc[(players_df['birthYear']>1992), ['playerID', 'birthYear']]

       playerID  birthYear
5234  nugenry01     1993.0
6280  scheima01     1993.0
7737  zibanmi01     1993.0

### Pipe
Applies formula to df

In [333]:
players_df_trim_df['birthYear'].pipe(lambda a : a > 1985).value_counts()

False    4061
True      566
Name: birthYear, dtype: int64

In [56]:
def mem_mib(df):
    print('{0:,.2f} MiB'.format(df.memory_usage().sum()/1024**2))

In [58]:
mem_mib(players_df)
mem_mib(players_df_trim_df)

1.67 MiB
0.39 MiB

## Categories

In [338]:
players_df_trim_df.loc[:, 'pos']= pd.Categorical(players_df_trim_df['pos'])

In [341]:
players_df_trim_df.loc[:,'pos'].cat.categories

Index(['C', 'D', 'F', 'G', 'L', 'L/C', 'R'], dtype='object')

In [344]:
players_df_trim_df.loc[:, 'birthCountry']= pd.Categorical(players_df_trim_df['birthCountry'])
players_df_trim_df.loc[:, 'birthState']= pd.Categorical(players_df_trim_df['birthState'])

In [347]:
players_df_trim_df.loc[players_df_trim_df['birthCountry']=='Canada'].describe()

         birthYear     birthMon     birthDay
count  2750.000000  2750.000000  2750.000000
mean   1969.776000     5.819273    15.597091
std      10.771039     3.370813     8.924557
min    1940.000000     1.000000     1.000000
25%    1961.000000     3.000000     8.000000
50%    1969.000000     5.000000    15.000000
75%    1979.000000     9.000000    23.000000
max    1992.000000    12.000000    31.000000

In [350]:
players_df_trim_df.loc[:, 'birthCountry'].value_counts().head(2)

Canada    2750
USA        773
Name: birthCountry, dtype: int64

## Change index

In [352]:
players_df_trim_df = players_df_trim_df.set_index('playerID')

---
# SQL Alchemy
This sintax allows for an easier query

In [246]:
from sqlalchemy.sql import select
from sqlalchemy import create_engine, inspect
from sqlalchemy import Table, Column, Integer, String, MetaData, ForeignKey

In [329]:
engine = create_engine('sqlite:///test.db')

## Create Table and insert

In [149]:
conn = engine.connect()

In [330]:
metadata = MetaData()
users = Table('users', metadata, Column('id', Integer, primary_key=True), Column('name', String),Column('fullname', String))

In [331]:
addresses = Table('addresses', metadata, Column('id', Integer, primary_key=True), Column('user_id', None, ForeignKey('users.id')), 
                  Column('email_address', String, nullable=False))

In [332]:
metadata.create_all(engine)

In [155]:
ins = users.insert().values(name='jack', fullname='Jack Jones')
result = conn.execute(ins)

In [179]:
ins = users.insert()
conn.execute(ins, name='wendy', fullname='Wendy Williams')

In [157]:
conn.execute(addresses.insert(), [
{'user_id': 1, 'email_address' : 'jack@yahoo.com'},
{'user_id': 1, 'email_address' : 'jack@msn.com'},
{'user_id': 2, 'email_address' : 'www@www.org'},
{'user_id': 2, 'email_address' : 'wendy@aol.com'},
])

In [178]:
conn.execute(users.update().values(name='wendy', fullname='Wendy Jones').where(users.c.id== 2))

## Reflecting the Metadata of an existing DB Table
<https://docs.sqlalchemy.org/en/latest/core/reflection.html>

### Single Table

In [211]:
meta = MetaData()

In [212]:
users = Table('users', meta, autoload=True, autoload_with=engine)

In [213]:
[c.name for c in users.columns]

# pprint.pprint(meta)

['id', 'name', 'fullname']

### All Tables

In [238]:
meta = MetaData()
meta.reflect(bind=engine)
pprint.pprint(meta.tables, indent=4, width=80, depth=2)
# users_table = meta.tables['users']
# addresses_table = meta.tables['addresses']

{   'addresses': Table('addresses', MetaData(bind=None), Column('id', INTEGER(), table=<addresses>, primary_key=True, nullable=False), Column('user_id', INTEGER(), ForeignKey('users.id'), table=<addresses>), Column('email_address', VARCHAR(), table=<addresses>, nullable=False), schema=None),
    'users': Table('users', MetaData(bind=None), Column('id', INTEGER(), table=<users>, primary_key=True, nullable=False), Column('name', VARCHAR(), table=<users>), Column('fullname', VARCHAR(), table=<users>), schema=None)}

In [243]:
len(meta.sorted_tables)

2

Alternatively an inspector can be used

In [247]:
insp = inspect(engine)

In [261]:
insp.get_columns('users', schema=None)
insp.get_foreign_keys('users')
insp.get_schema_names()

['main']

In [266]:
print(insp.get_table_names())

['addresses', 'users']

In [356]:
insp.get_table_names()
users_columns  =insp.get_columns('users', schema=None)
users_columns[0]

{'name': 'id',
 'type': INTEGER(),
 'nullable': False,
 'default': None,
 'autoincrement': 'auto',
 'primary_key': 1}

## SELECT

In [135]:
s = select([users])
result = conn.execute(s)

2019-04-07 14:53:01,178 INFO sqlalchemy.engine.base.Engine SELECT users.id, users.name, users.fullname
FROM users
2019-04-07 14:53:01,180 INFO sqlalchemy.engine.base.Engine ()

In [136]:
s = select([users.c.name, users.c.fullname])

In [137]:
conn.execute(s).fetchone()

2019-04-07 14:53:06,124 INFO sqlalchemy.engine.base.Engine SELECT users.name, users.fullname
FROM users
2019-04-07 14:53:06,126 INFO sqlalchemy.engine.base.Engine ()

('jack', 'Jack Jones')

In [139]:
from sqlalchemy.sql import and_, or_, not_

In [144]:
# Select name, fullname from users where id <2 and name = 'jack'
s = select([users.c.name, users.c.fullname]).where(and_(users.c.id <2, users.c.name =='jack'))
conn.execute(s).fetchall()

2019-04-07 14:56:31,980 INFO sqlalchemy.engine.base.Engine SELECT users.name, users.fullname
FROM users
WHERE users.id < ? AND users.name = ?
2019-04-07 14:56:31,982 INFO sqlalchemy.engine.base.Engine (2, 'jack')

[('jack', 'Jack Jones')]

## Joins

In [140]:
s = select([users, addresses]).where(users.c.id == addresses.c.user_id)
conn.execute(s).fetchall()

2019-04-07 14:54:26,796 INFO sqlalchemy.engine.base.Engine SELECT users.id, users.name, users.fullname, addresses.id, addresses.user_id, addresses.email_address
FROM users, addresses
WHERE users.id = addresses.user_id
2019-04-07 14:54:26,797 INFO sqlalchemy.engine.base.Engine ()

[(1, 'jack', 'Jack Jones', 1, 1, 'jack@yahoo.com'),
 (1, 'jack', 'Jack Jones', 2, 1, 'jack@msn.com'),
 (2, 'wendy', 'Wendy Williams', 3, 2, 'www@www.org'),
 (2, 'wendy', 'Wendy Williams', 4, 2, 'wendy@aol.com')]

In [146]:
s = select([users.c.fullname]).select_from(users.outerjoin(addresses))
print(s)

SELECT users.fullname
FROM users LEFT OUTER JOIN addresses ON users.id = addresses.user_id

<https://mkaz.blog/code/python-string-format-cookbook/>

# Scores

In [359]:
score_df = pd.read_csv('./data/Scoring.csv')
score_df.head()

,playerID,year,stint,tmID,lgID,pos,GP,G,A,Pts,...,PostA,PostPts,PostPIM,Post+/-,PostPPG,PostPPA,PostSHG,PostSHA,PostGWG,PostSOG
0,aaltoan01,1997,1,ANA,NHL,C,3.0,0.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,aaltoan01,1998,1,ANA,NHL,C,73.0,3.0,5.0,8.0,...,0.0,0.0,2.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,aaltoan01,1999,1,ANA,NHL,C,63.0,7.0,11.0,18.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,aaltoan01,2000,1,ANA,NHL,C,12.0,1.0,1.0,2.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,abbeybr01,1975,1,CIN,WHA,D,17.0,1.0,0.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
score_df = score_df.loc[(score_df["lgID"]=='NHL')&(score_df['year']>=1980)]

In [388]:
score_df = score_df.filter(regex='^(?!(Post|PP|SH)).*')
score_df['tmID'] = pd.Categorical(score_df['tmID'])
score_df =score_df.loc[:,['playerID', 'year', 'tmID', 'GP', 'G', 'A', 'Pts', 'SOG']]
score_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 28616 entries, 0 to 45966
Data columns (total 8 columns):
playerID    28616 non-null object
year        28616 non-null int64
tmID        28616 non-null category
GP          28508 non-null float64
G           28508 non-null float64
A           28508 non-null float64
Pts         28508 non-null float64
SOG         28508 non-null float64
dtypes: category(1), float64(5), int64(1), object(1)
memory usage: 1.8+ MB

In [391]:
score_df.index

Int64Index([    0,     1,     2,     3,     7,     8,     9,    10,    11,
               38,
            ...
            45957, 45958, 45959, 45960, 45961, 45962, 45963, 45964, 45965,
            45966],
           dtype='int64', length=28616)

reset index, restarts the index to be a sequence.

In [404]:
score_df.reset_index(drop=True, inplace=True)

In [405]:
teams_df = pd.read_csv('./data/Teams.csv')

In [406]:
teams_df.shape

(1519, 27)